Repository: thinkmobiles/UAE_TRA_iOS
Catalog: TRA Smart Services/Application/Resources/Localization/*.lproj/Localizable.strings
Languages: ar

# api.message.serverError
source: Your request cannot be processed at the moment. Please try again later.
ar: لا يمكن إتمام طلبكم. يرجى المحاولة لاحقاً

# api.message.noDataFound
source: Request completed successfully. No data found.
ar: تم الطلب بنجاح. لا توجد بيانات.

# uiElement.cancelButton.title
source: Cancel
ar: إلغاء

# uiElement.OKButton.title
source: OK
ar: موافق

# message.success
source: Success
ar: تم بنجاح

# message.EmptyInputParameters
source: Please enter text in the text field. All fields should be filled with required data.
ar: يرجى ملئ الحقل

# message.IncorrectRatings
source: Incorrect rating format - shoul use only numbers
ar: خطأ في الصيغة

# message.NoCameraPermissionsGranted
source: This app requires access to your device's Camera's. Please enable Camera access for this app in Settings / Privacy / Camera
ar: هذا التطبيق يتطلب الوصول إلى الكاميرا. يرجى تفعيل الوصول للكميرا من الإعدادات / الخصوصية / الكاميرا

# message.NoLocationPermissionGranted
source: This app requires access to your device's Location's. Please enable Location access for this app in Settings / Privacy / Location
ar: هذا التطبيق يتطلب الوصول إلى موقع الجهاز. يرجى تفعيل خدمات الموقع من الإعدادات / الخصوصية / خدمات الموقع

# message.NoLocationEnabledOnDevice
source: Location service disabled on your device. Please enable Location service and try again.
ar: خدمات الموقع غير مفعلة على هذا الجهاز. يرجى تفعيل خدمات الموقع من الإعدادات / الخصوصية / خدمات الموقع.

# message.NoInternetConnection
source: No internetConnection Avaliable. Please check your network and try again.
ar: لا يوجد اتصال بالانترنت. يرجى التحقق من الشبكة والمحاولة من جديد.

# message.IncorrectDomainName
source: Incorrect DomainName
ar: يرجى ادخال اسم نطاق صالح

# message.PasswordsNotEqual
source: Entered Password and Confirm password are not equal. Please correct and try again.
ar: يجب أن تتطابق كلمة المرور مع تأكيدها. يرجى المحاولة من جديد.

# message.OperationCanceledByUser
source: Operation canceled by user
ar: تم إلغاء العملية من قبل المستخدم

# message.InvalidFormatUserName
source: User credentials Invalid
ar: معلومات الدخول غير صحيحة

# message.InvalidFormatIDEmirates
source: Invalid Invalid Emirates ID
ar: هوية إمارات غير صالحة

# message.InvalidFormatFirstName
source: Invalid First Name
ar: يرجى ادخال الاسم

# message.InvalidFormatLastName
source: Invalid Last Name
ar: يرجى ادخال اللقب

# message.InvalidFormatMobile
source: Invalid mobilePhone
ar: رقم جوال خاطئ

# message.InvalidFormatEmail
source: Invalid Email
ar: يرجى ادخال عنوان بريد إلكتروني صحيح

# message.InvalidFormatURL
source: Invalid URL format. Example: http(s)://name.domain
ar: الرابط غير صحيح

# message.InvalidStateCode
source: Invalid State Code. Please use numbers as follow: 'Abu Dhabi': 1, 'Ajman': 2, 'Dubai': 3, 'Fujairah': 4, 'Ras al-Khaiman': 5,'Sharjah': 6, 'Umm al-Quwain': 7
ar: رمز الإمارة غير صحيح. يرجى التقيد بالرموز التالية: 'أبوظبي': 1, 'عجمان': 2, 'دبي': 3, 'الفجيرة': 4, 'رأس الخيمة': 5,'الشارقة': 6, 'أم القيوين': 7

# message.FailedToSendSMS
source: Cant sent SMS
ar: لايمكن ارسال الرسالة القصيرة

# message.FailedToInitializeMFController
source: You cant sent SMS from this Device
ar: لايمكن ارسال رسائل قصيرة من هذا الجهاز

# message.PasswordIsTooShort8
source: Password is too short. It must contain 8 characters at least
ar: كلمة المرور قصيرة. يجب أن تحتوي على ثمانية محرف على الأقل

# message.PasswordIsTooLong32
source: Password is too long. It should constrain less than 32 characters at least
ar: كلمة المرور يجب أن لا تتجاوز أثنين و ثلاثين محرفاً

# message.UserNameIsTooShort3
source: User Name is too short. It must contain 3 characters at least
ar: اسم المستخدم يجب أن يتكون من ثلاثة محارف على الأقل

# message.UserNameIsTooLong32
source: User Name is too long. It should constrain less than 32 characters at least
ar: اسم المستخدم يجب أن لا تتكون من أكثر من أثنين و ثلاثين محرفاً

# message.UserName1charValidation
source: Username should not start with digit
ar: اسم المستخدم يجب أن يبدأ بحرف

# state.SelectState
source: Select Emirate
ar: الإمارة

# state.Abu.Dhabi
source: Abu Dhabi
ar: أبوظبي

# state.Ajman
source: Ajman
ar: عجمان

# state.Dubai
source: Dubai
ar: دبي

# state.Fujairah
source: Fujairah
ar: الفجيرة

# state.Ras
source: Ras al-Khaimah
ar: رأس الخيمة

# state.Sharjan
source: Sharjah
ar: الشارقة

# state.Quwain
source: Umm al-Quwain
ar: أم القيوين

# providerType.selectProvider.text
source: Tap to select
ar: اختر مزود الخدمة

# providerType.Du
source: Du
ar: دو

# providerType.Etisalat
source: Etisalat
ar: إتصالات

# providerType.Yahsat
source: Yahsat
ar: ياسات

# tabBarMenu_item_1
source: Home
ar: الرئيسية

# tabBarMenu_item_2
source: Favorite
ar: المفضلة

# tabBarMenu_item_3
source: Info Hub
ar: معلومات

# tabBarMenu_item_4
source: Enquires
ar: استفسارات

# tabBarMenu_item_5
source: Settings
ar: إعدادات

# login.title
source: Login
ar: تسجيل الدخول

# login.placeHolderText.username
source: Username
ar: اسم المستخدم

# login.placeHolderText.password
source: Password
ar: كلمة المرور

# login.button.login
source: Login
ar: تسجيل الدخول

# login.button.forgotPassword
source: Password?
ar: نسيت كلمة المرور

# login.button.registerButton
source: Register
ar: تسجيل

# login.restore_password.message
source: To restore password, please enter your email that was used during registration
ar: لاستعادة كلمة المرور، يرجى ادخال البريد الإلكتروني المستخدم عند التسجيل.

# login.picker.genre.male
source: Male
ar: ذكر

# login.picker.genre.female
source: Female
ar: انثى

# register.title
source: Create account
ar: تسجيل

# register.placeholderText.username
source: Username
ar: اسم المستخدم

# register.placeHolderText.gender
source: Gender
ar: النوع

# register.placeHolderText.phone
source: Phone
ar: الجوال

# register.placeHolderText.password
source: Password
ar: كلمة المرور

# register.button.register
source: Register
ar: تسجيل

# register.button.login
source: Login
ar: تسجيل الدخول

# register.placeHolderText.confirmPassword
source: Confirm password
ar: تأكيد كلمة المرور

# register.placeHolderText.firstName
source: First Name
ar: الاسم

# register.placeHolderText.emirateID
source: e.g: 784-YYYY-NNNNNNN-C
ar: هوة الإمارات

# register.placeHolderText.lastName
source: Last Name
ar: اللقب

# register.placeHolderText.address
source: Address
ar: العنوان

# register.placeHolderText.landline
source: Landline
ar: الهاتف الأرضي

# register.placeHolderText.country
source: Country
ar: البلد

# register.placeHolderText.email
source: Email
ar: البريد الالكتروني

# register.placeHolderText.state
source: State
ar: الامارة

# register.label.registerInfo
source: Select a registration method
ar: اختر طريقة التسجيل

# register.label.emiratesID
source: Emirates ID Verification
ar: التحقق من هوية الإمارات

# register.label.fillForm
source: Fill-up Form (Manual)
ar: ملئ الاستمارة

# restorePassword.title
source: Restore Password
ar: استعادة كلمة المرور

# restorePassword.PlaceholderText.email
source: Email
ar: البريد الالكتروني

# restorePassword.button.restore
source: Restore Password
ar: استعادة كلمة المرور

# restorePassword.information.label.text
source: If you have forgotten your password, please enter your email below and a new password will be sent to you.
ar: إذا كنت قد نسيت كلمة المرور، يرجى إدخال عنوان بريدك الإلكتروني وسوف نرسل لك رسالة بكلمة مرور جديدة.

# settings.title
source: Settings
ar: إعدادات

# settings.title.aboutTra
source: About TRA
ar: عن الهيئة

# settings.label.language
source: Language Preference
ar: اللغة

# settings.label.fontsize
source: Font Size Display
ar: حجم الخط

# settings.label.colorImpaired
source: Color Impaired
ar: بدون ألوان

# settings.label.screenLockNotificationTitle
source: Screen Lock Notification
ar: عرض الإخطارات عند قفل الجهاز

# settings.label.screenLockNotificationDetauils
source: Show notification while mobile is locked
ar: عرض الإخطارات عندما يكون الجهاز مقفلاً

# settings.label.appTutorialScreensTitle
source: App Tutorial Screens
ar: شاشات المساعدة

# settings.label.appTutorialScreensDetails
source: Activates tutorial screens
ar: تفعيل شاشات المساعدة للبرنامج

# settings.label.colorThemeTitle
source: Color Theme
ar: تغيير اللون

# settings.label.colorThemeDetails
source: Change color theme for app
ar: تغيير نمط اللون

# settings.label.aboutTRATitle
source: About TRA
ar: عن الهيئة

# settings.label.aboutTRADetails
source: Read mare about TRA
ar: اقرأ المزيد عن الهيئة

# settings.label.fontsize.description.small
source: Small
ar: صغير

# settings.label.fontsize.description.normal
source: Normal
ar: عادي

# settings.label.fontsize.description.large
source: Large
ar: كبير

# setting.label.release
source: Release Version
ar: الإصدار

# setting.label.touchID
source: Use Touch ID
ar: استخدام البصمة

# setting.label.touchIDDEscription
source: Use your fingerprint for authentification process
ar: استخدم بصمتك لإتمام لتسجيل الدخول

# setting.loginRequired.message
source: Please login to enable this option
ar: يرجى تسجيل الدخول للوصل لهذه الخدمة

# fingerPrintService.DescriptionReason
source: Scan you finger to get access to all services
ar: يرجى مسح البصمة للوصول للخدمات

# speedAccess.service.name.0
source: Domain Info
ar: تفاصيل النطاق

# speedAccess.service.name.1
source: Domain Avaliability
ar: تحقق من توفر النطاق

# speedAccess.service.name.2
source: Domain Check
ar: تحقق من نطاق

# speedAccess.service.name.3
source: Mobile Brand
ar: الأجهزة المعتمدة

# speedAccess.service.name.4
source: Feedback
ar: تعليقاتكم

# speedAccess.service.name.5
source: Spam Report
ar: رسائل غير مرغوبة

# speedAccess.service.name.6
source: Help Salim
ar: ساعد سالم

# speedAccess.service.name.7
source: Verification
ar: تحقق

# speedAccess.service.name.8
source: Coverage
ar: التغطية

# speedAccess.service.name.9
source: Internet
ar: انترنت

# speedAccess.service.name.10
source: Complain about Service Provider
ar: شكوى على مزود خدمة

# speedAccess.service.name.11
source: Suggestion
ar: اقتراح

# speedAccess.service.name.12
source: Enquires
ar: استفسارات

# speedAccess.service.name.13
source: Complain about TRA
ar: شكوى على الهيئة

# notificationsViewController.NotificationPlaceHolderlabel
source: There are no notifications for you at the moment
ar: ليس لديك أية إخطارات حالياً

# notificationsViewController.noNotificationsMessage
source: You have no notifications
ar: لا توجد إخطارات

# notificationsViewController.NotificationsMessage
source: You have (%i) notifications
ar: لديك (%i) إخطارات

# notificationsViewController.clearAllButton.title
source: Clear All
ar: مسح الكل

# favourite.title
source: Favorites
ar: المفضلة

# favourite.button.addFav.title
source: Add a Service
ar: إضافة خدمة

# favourite.notification
source: You have not selected a TRA service as part of your Favorites list yet
ar: لم تقم باختيار خدمة ضمن قائمة الخدمات المفضلة.

# favouriteCell.infoButton.title
source: Service Info
ar: معلومات الخدمة

# favouriteCell.deleteButton.title
source: Remove
ar: حذف

# serviceInfoItemName.0
source: About the Service
ar: عن الخدمة

# serviceInfoItemName.1
source: Required Documents
ar: الوثائق المطلوبة

# serviceInfoItemName.2
source: Terms and Conditions
ar: شروط و متطلبات الحصول على الخدمة

# serviceInfoItemName.3
source: Service Package
ar: باقة الخدمة

# serviceInfoItemName.4
source: Expected Time
ar: زمن تقديم الخدمة

# serviceInfoItemName.5
source: Service Fees
ar: رسوم الخدمة

# serviceInfoItemName.6
source: Officer in Charge of this Service
ar: المسؤول المباشر عن الخدمة

# coverageReport.very_weak
source: Very Weak
ar: ضعيفة جداً

# coverageReport.weak
source: Weak
ar: ضعيفة

# coverageReport.good
source: Good
ar: جيدة

# coverageReport.strong
source: Strong
ar: قوية

# coverageReport.veryStrong
source: Very Strong
ar: قوية جداً

# coverageLevel.title
source: Coverage Level
ar: قوة التغطية

# coverageReport.reportSignalButton.title
source: Report signal
ar: تقرير عن قوة الإشارة

# coverageReport.detectLocationButton.title
source: Detect location
ar: تحديد الموقع

# coverageReport.addressTextField
source: Address
ar: العنوان

# coverageReport.alertButton2.title
source: Enter address manually
ar: ادخل العنوان

# infoHub.title
source: Info Hub
ar: معلومات

# announcements.label.text
source: Announcement
ar: اعلانات

# seeMore.button.title
source: See more
ar: شاهد المزيد

# transactions.label.text
source: Transactions
ar: معاملات

# infoHubViewController.transactionNotDataLabel
source: You do not have any active transactions.
ar: ليس لديك أية معاملات قيد التنفيذ

# annoucements.title
source: Info Hub Announcements
ar: معلومات اعلانات

# details.title
source: Info Hub Details
ar: معلومات

# searchMobileBrandNameViewController.title
source: Search Mobile Brand
ar: الأجهزة المعتمدة

# searchMobileBrandNameViewController.searchButton
source: Search brand name
ar: بحث

# searchMobileBrandNameViewController.searchTextField.placeholder
source: Enter Brand Name
ar: ادخل اسم المصنع

# suggestionViewController.title
source: Send Suggestion
ar: اسرل اقتراحاً

# suggestionViewController.textField.suggestionTitle
source: Title
ar: عنوان

# suggestionViewController.textField.suggestionDescription
source: Description
ar: شرح

# suggestionViewController.selectImageButton.title
source: Image
ar: صورة

# suggestionViewController.sendSuggestionButton.title
source: Send suggestion
ar: أرسل

# compliantViewController.title.comtlaintTRA
source: Complain About TRA
ar: شكوى على الهيئة

# compliantViewController.title.enquires
source: Enquires
ar: استفسارات

# compliantViewController.title.compliantAboutServiceProvider
source: Complaint About Service Provider
ar: شكوى على مزود خدمة

# compliantViewController.compliantTitleTextField.placeholder
source: Title
ar: عنوان

# compliantViewController.referenceNumberTextField.placeholder
source: Reference number
ar: الرقم المرجعي

# compliantViewController.description.placeholder
source: Description
ar: شرح

# compliantViewController.compliantSendBarButtonItem.title
source: Send
ar: ارسل

# spamReportViewControler.title.spamSMS
source: SMS Spam Report
ar: رسائل غير مرغوبة

# spamReportViewControler.title.spamWEB
source: Help Salim
ar: ساعد سالم

# spamReportViewControler.reportTextField.reportSMS
source: Spammer number/alias
ar: الرقم

# spamReportViewControler.reportTextField.reportWeb
source: Link
ar: الرابط

# spamReportViewControler.reportButton.title
source: Report
ar: ارسل

# spamReportViewControler.descriptionTextView.placeholder
source: Description
ar: انسخ والصق الرسالة الغير مرغوبة هنا

# internetSpeedTestViewController.title
source: Speed Test
ar: اختبار السرعة

# internetSpeedTestViewController.checkButton.title
source: Check Speed
ar: فحص السرعة

# InternetSpeedTestViewController.speedTestResult.text
source: Connection speed - %.6f Mb/sec
ar: Your speed - %.6f Mb/sec

# postFeedbackViewController.title
source: Post Feedback
ar: ارسل تعليقاً

# postFeedbackViewController.serviceNameTextField
source: Servise
ar: خدمة

# postFeedbackViewController.ratingTextField
source: Rating
ar: تقييم

# postFeedbackViewController.feedbackLabel.text
source: Feedback
ar: تعليقاتكم

# postFeedbackViewController.sendButton.title
source: Send
ar: ارسل

# checkDomainViewController.title
source: Domain check
ar: التحقق من نطاق

# checkDomainViewController.domainNameTextField
source: Insert Domain name here
ar: اسم النطاق

# checkDomainViewController.avaliabilityButton.title
source: AVALIABILITY
ar: تحقق من توفر النطاق

# checkDomainViewController.whoISButton.title
source: WHOIS
ar: تفاصيل النطاق

# checkDomainViewController.domainTitleForView
source: Domain Check Service
ar: خدمة التحقق من نطاق

# checkDomainViewController.chooseRating
source: Choose Rating
ar: اختر تقييماً

# checkIMEIViewController.title
source: Check IMEI
ar: تحقق من جهاز

# checkIMEIViewController.checkIMEIButton.title
source: Check IMEI
ar: تحقق من رقم IMEI

# userProfile.title
source: User Profile
ar: الملف الشخصي

# userProfile.EditProfile
source: Edit Profile
ar: تعديل الملف الشخصي

# userProfile.changePassword
source: Change Password
ar: تغيير كلمة المرور

# userProfile.resetPassword
source: Reset Password
ar: تغيير كلمة المرور

# userProfile.logoutFromAccount
source: Logout from your Account
ar: تسجيل الخروج

# userProfile.notificationMesasge
source: Are you sure that you want to logout?
ar: هل أنت متأكد من أنك تريد تسجيل الخروج؟

# resetPassword.info
source: To reset your password, please type your email in the field below and a temporary password will by send to you.
ar: لتغيير كلمة المرور، يرجى إدخال عنوان بريدك الإلكتروني و سوف نرسل لك رسالة.

# resetPassword.email
source: Email
ar: البريد الإلكتروني

# resetPassword.retypeEmail
source: Retype your email
ar: إعادة البريد الإلكتروني

# changePassword.oldPassword
source: OLD PASSWORD
ar: كلمة المرور القديمة

# changePassword.placeHolder.oldPassword
source: Old Password
ar: كلمة المرور القديمة

# changePassword.password
source: NEW PASSWORD
ar: كلمة المرور الجديدة

# changePassword.placeHolder.password
source: New Password
ar: كلمة المرور الجديدة

# changePassword.retypePassword
source: RETYPE NEW PASSWORD
ar: إعادة كملة المرور

# changePassword.placeHolder.retypePassword
source: Retype New Password
ar: تأكيد كلمة المرور الجديدة

# userProfileActionView.cancel
source: CANCEL
ar: إلغاء

# userProfileActionView.reset
source: RESET
ar: استعادة

# userProfileActionView.save
source: SAVE CHANGES
ar: حفظ

# homeSearchViewController.homeSearchLabel.text
source: ARE YOU LOOKING FOR:
ar: هل تبحث عن:

# homeSearchViewController.homeSearchTextField.placeholder
source: Search
ar: بحث

# editUserProfileViewController.emiratesLabel
source: EMIRATE
ar: الإمارة

# editUserProfileViewController.contactnumberLabel
source: CONTACT NUMBER
ar: رقم الاتصال

# editUserProfileViewController.firstNameLabel
source: FIRST NAME
ar: الاسم

# editUserProfileViewController.lastNameLabel
source: LAST NAME
ar: اللقب

# editUserProfileViewController.streetAddressLabel
source: STREET ADDRESS
ar: العنوان

# editUserProfileViewController.dataSource.0element
source: Tap to select
ar: اختيار

# homeSearchResultViewController.title
source: Search Result
ar: نتائج البحث

# verificationIMEIViewController.title
source: Device Verification
ar: تحقق من رقم IMEI

# verificationIMEIViewController.serviceHeaderLabel
source: Enter the IMEI code of the mobile phone to be verified
ar: ادخل رقم IMEI للجهاز المراد التحقق منه.

# verificationIMEIViewController.sendIMEICodeLabel
source: SEND IMEI CODE
ar: ارسل

# verificationIMEIViewController.verificationIMEITextField.placeholder
source: Enter here
ar: اكتب هنا

# TRALoader.backButton.title
source: Сlose
ar: عودة إلى الرئيسية

# TRALoader.backButton.cancel
source: Cancel
ar: الغاء

# TRALoader.information.begin
source: Give us a moment while processing %@ request
ar: لحظات من فضلك...

# TRALoader.information.finish
source: Your Request has been successfully sent
ar: تم ارسال طلبك بنجاح

# autoLogin.message
source: Logging in...
ar: جاري تسجيل الدخول

# fingerPrintService.passwordRequest.message
source: Scan your finger to get access to services
ar: امسح بصمتك للوصول للخدمات

# fingerPrintService.CancelAuth.title
source: Cancel auth
ar: إلغاء الدخول

# fingerPrintService.ConfirmPassword.title
source: Enter password
ar: ادخل كلمة المرور

# fingerPrintService.TouchIDNotEnrolled
source: Touch ID Do not Entolled
ar: الدخول بالبصمة غير مفعل

# fingerPrintService.PasscodeHasNotBeenSet
source: Password Has been not Set
ar: لم يتم تعيين كلمة المرور

# fingerPrintService.TouchIdNotAvaliable
source: Touch ID not avliable
ar: الدخول بالبصمة غير متوفر

# fingerPrintService.LoginCanceledBySystem
source: Process canceled by System
ar: تم إلغاء العملية

# fingerPrintService.LoginCanceledByUser
source: Process canceled by User
ar: تم الإلغاء من قبل المستخدم

# fingerPrintService.InvalidFingerPrint
source: Invalid fingerprint
ar: بصمة غير صحيحة

# spamListViewController.title
source: My List
ar: قائمتي

# innovationsCollectionViewCell.string.reviewed
source: Reviewed
ar: تمت المراجعة

# innovationsChatTableViewCell.replyButton.title
source: Reply
ar: إرسال رد

# innovationsChatTableViewCell.reportAbuseButton.title
source: Report Abuse
ar: شكوى

# spamSelectionViewController.title
source: Spam
ar: رسائل غير مرغوبة

# spamSelectionViewController.serviceHeaderLabel
source: Report SMS or Websites as Spam to TRA
ar: شكاوي الرسائل الغير مرغوبة و مواقع الإنترنت

# spamSelectionViewController.serviceSelectionView.reportSMSLabel
source: Report SMS
ar: شكوى على رسالة غير مرغوبة

# spamSelectionViewController.serviceSelectionView.reportWEBLabel
source: Help Salim
ar: شكوى على موقع إنترنت

# spamSelectionViewController.serviceSelectionView.viewMyListLabel
source: View My List
ar: عرض القائمة الخاصة

# listOfMobileBrandViewController.title
source: List of Mobile Brand
ar: الأجهزة المعتمدة

# listOfDevicesViewController.title
source: List of Devices
ar: قائمة الإجهزة

# listOfDevicesViewController.devicesNotDataLabel
source: Not Data Found
ar: لا توجد بيانات

# innovationsViewController.title
source: Innovations
ar: مركز الإبداع و الابتكار

# innovationsViewController.submitButton
source: Submit
ar: أرسل

# innovationsViewController.innovationsTitleTextField.placeholder
source: Title
ar: العنوان

# innovationsViewController.descriptionTextView.placeholder
source: Type your message here...
ar: أكتب الرسالة هنا...

# innovationsViewController.selectInnovativeIdeasFor0
source: Innovative Ideas for
ar: أفكار ابتكارية تساهم بـ

# innovationsViewController.selectInnovativeIdeasFor1
source: Customer Happiness
ar: اسعاد المتعاملين

# innovationsViewController.selectInnovativeIdeasFor2
source: Employee Satisfaction
ar: رضا الموظفين

# innovationsViewController.selectInnovativeIdeasFor3
source: TRA Service Improvement
ar: تطوير خدمات الهيئة

# innovationsViewController.selectInnovativeIdeasFor4
source: Reducing cost & increasing Revenue
ar: زيادة الإيرادات وترشيد النفقات

# innovationsViewController.selectInnovativeIdeasFor5
source: Raising TRA Institutional Reputation
ar: رفع صورة الهيئة وسمعتها المؤسسية

# innovationsViewController.selectInnovativeIdeasFor6
source: Futurology Studies
ar: استشراف المستقبل

# resultIMEIViewController.title
source: Result IMEI Code
ar: نتيجة البحث

# resultIMEIViewController.noDeviceDatabase
source: No result for this IMEI
ar: لا توجد نتائج

# selectImageActionSheet.cancel
source: Cancel
ar: الغاء

# selectImageActionSheet.removeFile
source: Remove attached file
ar: حذف الملف المرفق

# selectImageActionSheet.selectImage
source: Choose image from gallery
ar: اختر من معرض الصور
